In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [10]:
import pandas as pd

In [11]:
import numpy as np

In [5]:
obj1 = pd.Series([5,6,3,4])
obj1

0    5
1    6
2    3
3    4
dtype: int64

In [ ]:
obj1[obj1>4]

0    5
1    6
dtype: int64

In [ ]:
obj1 = pd.Series([5,1,3,8,4],index=['a','b','c','d','e'])
obj1

a    5
b    1
c    3
d    8
e    4
dtype: int64

In [ ]:
obj1['a']

5

In [ ]:
obj1[['a','c','e']]

a    5
c    3
e    4
dtype: int64

In [ ]:
obj1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
np.exp(obj1)

a     148.413159
b       2.718282
c      20.085537
d    2980.957987
e      54.598150
dtype: float64

In [6]:
my_dict = {'Shaxzod':19,'Ali':18,'Jahongir':20,'Rustam':19}
type(my_dict)

dict

In [ ]:
my_ser = pd.Series(my_dict)
type(my_ser)

pandas.core.series.Series

In [ ]:
my_ser

Shaxzod     19
Ali         18
Jahongir    20
Rustam      19
dtype: int64

In [ ]:
inds = ['Ali','Rustam','Jahongir','Shaxzod','Botir']
my_ser1 = pd.Series(my_ser,index=inds)

In [ ]:
my_ser.isnull

<bound method Series.isnull of Shaxzod     19
Ali         18
Jahongir    20
Rustam      19
dtype: int64>

In [ ]:
pd.isnull(my_ser1)

Ali         False
Rustam      False
Jahongir    False
Shaxzod     False
Botir        True
dtype: bool

In [ ]:
my_ser1

Ali         18.0
Rustam      19.0
Jahongir    20.0
Shaxzod     19.0
Botir        NaN
dtype: float64

In [ ]:
my_ser

Shaxzod     19
Ali         18
Jahongir    20
Rustam      19
dtype: int64

In [ ]:
my_ser + my_ser1

Ali         36.0
Botir        NaN
Jahongir    40.0
Rustam      38.0
Shaxzod     38.0
dtype: float64

In [ ]:
my_ser*my_ser1

Ali         324.0
Botir         NaN
Jahongir    400.0
Rustam      361.0
Shaxzod     361.0
dtype: float64

In [ ]:
my_ser2 = pd.Series(['Shaxzod','Rahmonov','talaba','dasturchi'],index=['ismi','familyasi','unvoni','kasbi'])
my_ser2

ismi           Shaxzod
familyasi     Rahmonov
unvoni          talaba
kasbi        dasturchi
dtype: object

In [ ]:
my_ser3 = pd.Series(['Nurik','Yarashabayev','talaba','dasturchi_AI'],index=['ismi','familyasi','unvoni','kasbi'])
my_ser3

ismi                Nurik
familyasi    Yarashabayev
unvoni             talaba
kasbi        dasturchi_AI
dtype: object

In [ ]:
my_ser4 = pd.Series(my_ser2,index=['familyasi','ismi','maoshi','unvoni','kasbi','staji'])
my_ser5 = pd.Series(my_ser3,index=['familyasi','ismi','maoshi','unvoni','kasbi','staji'])

In [ ]:
my_ser4

familyasi     Rahmonov
ismi           Shaxzod
maoshi             NaN
unvoni          talaba
kasbi        dasturchi
staji              NaN
dtype: object

In [ ]:
my_ser5

familyasi    Yarashabayev
ismi                Nurik
maoshi                NaN
unvoni             talaba
kasbi        dasturchi_AI
staji                 NaN
dtype: object

In [ ]:
my_ser4.name = "Shaxzodjon"

In [ ]:
my_ser4.index.name="atributlari"
my_ser4

atributlari
familyasi     Rahmonov
ismi           Shaxzod
maoshi             NaN
unvoni          talaba
kasbi        dasturchi
staji              NaN
Name: Shaxzodjon, dtype: object

In [ ]:
my_ser4['maoshi']=5000

In [ ]:
my_ser4

atributlari
familyasi     Rahmonov
ismi           Shaxzod
maoshi            5000
unvoni          talaba
kasbi        dasturchi
staji              NaN
Name: Shaxzodjon, dtype: object

In [ ]:
my_ser4+my_ser5

atributlari
familyasi     RahmonovYarashabayev
ismi                  ShaxzodNurik
maoshi                         NaN
unvoni                talabatalaba
kasbi        dasturchidasturchi_AI
staji                          NaN
dtype: object

In [ ]:
my_ser4.index

Index(['familyasi', 'ismi', 'maoshi', 'unvoni', 'kasbi', 'staji'], dtype='object', name='atributlari')

In [ ]:
my_ser4.values

array(['Rahmonov', 'Shaxzod', 5000, 'talaba', 'dasturchi', nan],
      dtype=object)

In [ ]:
pd.notnull(my_ser5)

familyasi     True
ismi          True
maoshi       False
unvoni        True
kasbi         True
staji        False
dtype: bool

In [ ]:
my_ser5

familyasi    Yarashabayev
ismi                Nurik
maoshi                NaN
unvoni             talaba
kasbi        dasturchi_AI
staji                 NaN
dtype: object

In [ ]:
my_ser5.hasnans

True

In [ ]:
my_ser5.is_unique

False

In [ ]:
my_ser5.shape

(6,)

In [ ]:
my_ser5.size

6

In [ ]:
my_ser5.iloc[3]

'talaba'

In [ ]:
my_ser5.loc['unvoni']

'talaba'

In [ ]:
my_ser5.max

<bound method NDFrame._add_numeric_operations.<locals>.max of familyasi    Yarashabayev
ismi                Nurik
maoshi                NaN
unvoni             talaba
kasbi        dasturchi_AI
staji                 NaN
dtype: object>

In [7]:
dataframe1 = pd.DataFrame({
    'ism':['Shaxzod','Rustamjon','Alisher','Muhammad','Nurgeldi'],
    'familya':['Rahmonov','Alijonov','Axmedov','Toshboltayev','Yarashbayev'],
    'yosh':[19,19,21,20,19],
    'qabul_turi':['grand','kantrakt','grand','kontrakt','grand']
})

In [8]:
dataframe1

         ism       familya  yosh qabul_turi
0    Shaxzod      Rahmonov    19      grand
1  Rustamjon      Alijonov    19   kantrakt
2    Alisher       Axmedov    21      grand
3   Muhammad  Toshboltayev    20   kontrakt
4   Nurgeldi   Yarashbayev    19      grand

In [ ]:
dataframe1.head(2)

         ism   familya  yosh qabul_turi
0    Shaxzod  Rahmonov    19      grand
1  Rustamjon  Alijonov    19   kantrakt

In [ ]:
dataframe1.ism

0      Shaxzod
1    Rustamjon
2      Alisher
3     Muhammad
4     Nurgeldi
Name: ism, dtype: object

In [ ]:
ismlar = pd.Series(['Shaxzod','Rustamjon','Alisher','Muhammad','Nurgeldi'])
ismlar

0      Shaxzod
1    Rustamjon
2      Alisher
3     Muhammad
4     Nurgeldi
dtype: object

In [ ]:
dataframe1['ism'] = ismlar

In [ ]:
dataframe1

         ism       familya  yosh qabul_turi
0    Shaxzod      Rahmonov    19      grand
1  Rustamjon      Alijonov    19   kantrakt
2    Alisher       Axmedov    21      grand
3   Muhammad  Toshboltayev    20   kontrakt
4   Nurgeldi   Yarashbayev    19      grand

In [ ]:
dataframe1['19+'] = dataframe1.yosh>19
dataframe1

         ism       familya  yosh qabul_turi    19+
0    Shaxzod      Rahmonov    19      grand  False
1  Rustamjon      Alijonov    19   kantrakt  False
2    Alisher       Axmedov    21      grand   True
3   Muhammad  Toshboltayev    20   kontrakt   True
4   Nurgeldi   Yarashbayev    19      grand  False

In [9]:
data = {
    'ism':['Shaxzod','Rustamjon','Alisher','Muhammad','Nurgeldi'],
    'familya':['Rahmonov','Alijonov','Axmedov','Toshboltayev','Yarashbayev'],
    'yosh':[19,19,21,20,19],
    'qabul_turi':['grand','kantrakt','grand','kontrakt','grand']
}
dataframe2 = pd.DataFrame(data,columns=['ism','familya','yosh','qabul_turi','gpa'])

NameError: name 'pd' is not defined

In [60]:
dataframe2

         ism       familya  yosh qabul_turi  gpa
0    Shaxzod      Rahmonov    19      grand  NaN
1  Rustamjon      Alijonov    19   kantrakt  NaN
2    Alisher       Axmedov    21      grand  NaN
3   Muhammad  Toshboltayev    20   kontrakt  NaN
4   Nurgeldi   Yarashbayev    19      grand  NaN

In [61]:
dataframe2 = pd.DataFrame(data,columns=['ism','familya','yosh','qabul_turi','gpa'],index=[11,12,13,14,15])

In [63]:
df = dataframe2
df

          ism       familya  yosh qabul_turi  gpa
11    Shaxzod      Rahmonov    19      grand  NaN
12  Rustamjon      Alijonov    19   kantrakt  NaN
13    Alisher       Axmedov    21      grand  NaN
14   Muhammad  Toshboltayev    20   kontrakt  NaN
15   Nurgeldi   Yarashbayev    19      grand  NaN

In [ ]:
gpaes = pd.DataFrame([4.5,4.2,3],index=[11,15,12])
dataframe2.gpa = gpaes

In [ ]:
dataframe2

          ism       familya  yosh qabul_turi  gpa
11    Shaxzod      Rahmonov    19      grand  4.5
12  Rustamjon      Alijonov    19   kantrakt  3.0
13    Alisher       Axmedov    21      grand  NaN
14   Muhammad  Toshboltayev    20   kontrakt  NaN
15   Nurgeldi   Yarashbayev    19      grand  4.2

In [8]:
from pandas import *
data = {'Yil':[2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
       'Aholi soni':[33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5],
       "Temp":[1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53]}
df = DataFrame(data)

In [3]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [4]:
arr = df.values

In [ ]:
arr

array([[2.021e+03, 3.390e+01, 1.540e+00],
       [2.020e+03, 3.350e+01, 1.480e+00],
       [2.019e+03, 3.290e+01, 1.560e+00],
       [2.018e+03, 3.250e+01, 1.620e+00],
       [2.017e+03, 3.190e+01, 1.650e+00],
       [2.016e+03, 3.140e+01, 1.660e+00],
       [2.015e+03, 3.090e+01, 1.640e+00],
       [2.010e+03, 2.850e+01, 1.530e+00]])

In [ ]:
df.head()

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65

In [ ]:
data = {
    'Uzbekistan':{2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'Kazakhstan':{2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8}
}

In [ ]:
df = DataFrame(data)

In [ ]:
df

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1
2016         NaN        17.8

In [ ]:
df.head()

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        18.1

            2021  2020  2019  2018  2017  2016
Uzbekistan  33.9  33.5  32.9  32.5  31.9   NaN
Kazakhstan  18.9  18.7  18.5  18.3  18.1  17.8

In [ ]:
df.values

array([[33.9, 18.9],
       [33.5, 18.7],
       [32.9, 18.5],
       [32.5, 18.3],
       [31.9, 18.1],
       [ 0. , 17.8]])

In [ ]:
df2 = DataFrame(data,index=[2021,2019,2017])
df2

      Uzbekistan  Kazakhstan
2021        33.9        18.9
2019        32.9        18.5
2017        31.9        18.1

In [ ]:
2021 in df2.index

True

In [ ]:
df.index.insert(2,2030)

Int64Index([2021, 2020, 2030, 2019, 2018, 2017, 2016], dtype='int64')

In [28]:
df

    Yil  Aholi soni  Temp
7  2021        33.9  1.54
4  2020        33.5  1.48
1  2019        32.9  1.56
2  2018        32.5  1.62
3  2017        31.9  1.65
6  2016        31.4  1.66
5  2015        30.9  1.64
0  2010        28.5  1.53

In [14]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [16]:
ind = df.index

In [17]:
ind

RangeIndex(start=0, stop=8, step=1)

In [18]:
type(ind)

pandas.core.indexes.range.RangeIndex

In [21]:
ind = [7,4,1,2,3,6,5,0]
df.index = ind
df

    Yil  Aholi soni  Temp
7  2021        33.9  1.54
4  2020        33.5  1.48
1  2019        32.9  1.56
2  2018        32.5  1.62
3  2017        31.9  1.65
6  2016        31.4  1.66
5  2015        30.9  1.64
0  2010        28.5  1.53

In [24]:
ind.sort()

In [25]:
ind

[0, 1, 2, 3, 4, 5, 6, 7]

In [49]:
df = df.reindex(ind)

In [50]:
df

   Aholi soni  Temp
0        28.5  1.53
1        32.9  1.56
2        32.5  1.62
3        31.9  1.65
4        33.5  1.48
5        30.9  1.64
6        31.4  1.66
7        33.9  1.54

In [32]:
df.reindex([4,5,7])

    Yil  Aholi soni  Temp
4  2020        33.5  1.48
5  2015        30.9  1.64
7  2021        33.9  1.54

In [51]:
df.reindex(index=range(0,8), method='ffill')

   Aholi soni  Temp
0        28.5  1.53
1        32.9  1.56
2        32.5  1.62
3        31.9  1.65
4        33.5  1.48
5        30.9  1.64
6        31.4  1.66
7        33.9  1.54

In [42]:
df = df.reindex(columns=['Aholi soni','Temp'])

In [43]:
df

   Aholi soni  Temp
7        33.9  1.54
4        33.5  1.48
1        32.9  1.56
2        32.5  1.62
3        31.9  1.65
6        31.4  1.66
5        30.9  1.64
0        28.5  1.53

In [46]:
df.sample(4)

   Aholi soni  Temp
3        31.9  1.65
1        32.9  1.56
2        32.5  1.62
7        33.9  1.54

In [52]:
df = df.loc[[1,2,3],['Aholi soni','Temp']]

In [53]:
df

   Aholi soni  Temp
1        32.9  1.56
2        32.5  1.62
3        31.9  1.65

In [54]:
df.drop(1)

   Aholi soni  Temp
2        32.5  1.62
3        31.9  1.65

In [55]:
df

   Aholi soni  Temp
1        32.9  1.56
2        32.5  1.62
3        31.9  1.65

In [56]:
df.drop('Temp',axis=1)

   Aholi soni
1        32.9
2        32.5
3        31.9

In [64]:
df

          ism       familya  yosh qabul_turi  gpa
11    Shaxzod      Rahmonov    19      grand  NaN
12  Rustamjon      Alijonov    19   kantrakt  NaN
13    Alisher       Axmedov    21      grand  NaN
14   Muhammad  Toshboltayev    20   kontrakt  NaN
15   Nurgeldi   Yarashbayev    19      grand  NaN

In [6]:
df.reindex(index=['a','b','c','d','e'])

   Yil  Aholi soni  Temp
a  NaN         NaN   NaN
b  NaN         NaN   NaN
c  NaN         NaN   NaN
d  NaN         NaN   NaN
e  NaN         NaN   NaN

In [7]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [17]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [19]:
df[0:4]

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62

In [20]:
df

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [26]:
data = df['Yil']
data

0    2021
1    2020
2    2019
3    2018
4    2017
5    2016
6    2015
7    2010
Name: Yil, dtype: int64

In [27]:
type(data)

pandas.core.series.Series

In [28]:
data[0:4]

0    2021
1    2020
2    2019
3    2018
Name: Yil, dtype: int64

In [29]:
data[4]

2017

In [31]:
data[[4]]

4    2017
5    2016
Name: Yil, dtype: int64

In [32]:
obj = Series(np.arange(8.),index=['a','b','c','d','e','f','g','h'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

In [33]:
obj['a']

0.0

In [34]:
obj[['a']]

a    0.0
dtype: float64

In [37]:
obj['a':'g']

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
dtype: float64

In [38]:
obj[0:4]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [39]:
obj[[1,5]]

b    1.0
f    5.0
dtype: float64

In [3]:
import pandas as pd
uz = {2015:30.4,2016:30.1,2017:32,2018:33.1,2019:33.4,2020:35.2}
kz = {2015:18.8,2016:19.1,2017:13.1,2018:10.1,2019:13.4,2020:15.2}
tj = {2015:9.6,2016:9.7,2017:9.8,2018:9.9,2019:10.4,2020:11.2}

In [4]:
df = pd.DataFrame({
'uzbekistan':uz,
'qozogiston':kz,
'tojigiston':tj}
)
df

      uzbekistan  qozogiston  tojigiston
2015        30.4        18.8         9.6
2016        30.1        19.1         9.7
2017        32.0        13.1         9.8
2018        33.1        10.1         9.9
2019        33.4        13.4        10.4
2020        35.2        15.2        11.2

In [8]:
df['uzbekistan'].to_numpy()

array([30.4, 30.1, 32. , 33.1, 33.4, 35.2])

In [12]:
df[3:]

      uzbekistan  qozogiston  tojigiston
2018        33.1        10.1         9.9
2019        33.4        13.4        10.4
2020        35.2        15.2        11.2

In [17]:
df[df['uzbekistan']>31]

      uzbekistan  qozogiston  tojigiston
2017        32.0        13.1         9.8
2018        33.1        10.1         9.9
2019        33.4        13.4        10.4
2020        35.2        15.2        11.2

In [18]:
df>31

      uzbekistan  qozogiston  tojigiston
2015       False       False       False
2016       False       False       False
2017        True       False       False
2018        True       False       False
2019        True       False       False
2020        True       False       False

In [19]:
df[df>31]

      uzbekistan  qozogiston  tojigiston
2015         NaN         NaN         NaN
2016         NaN         NaN         NaN
2017        32.0         NaN         NaN
2018        33.1         NaN         NaN
2019        33.4         NaN         NaN
2020        35.2         NaN         NaN

In [26]:
df2 = df[['uzbekistan']]
df2[df2['uzbekistan']>31]

      uzbekistan
2017        32.0
2018        33.1
2019        33.4
2020        35.2

In [33]:
df3 = df.transpose(copy=True)
df3

            2015  2016  2017  2018  2019  2020
uzbekistan  30.4  30.1  32.0  33.1  33.4  35.2
qozogiston  18.8  19.1  13.1  10.1  13.4  15.2
tojigiston   9.6   9.7   9.8   9.9  10.4  11.2

In [35]:
nums = list(range(4,12))
nums

[4, 5, 6, 7, 8, 9, 10, 11]

In [36]:
nums[-1]

11

In [42]:
df
import numpy as np

In [48]:
sr = pd.Series(np.arange(6,10))
sr

0    6
1    7
2    8
3    9
dtype: int32

In [49]:
sr = pd.Series(np.arange(6,10),index=['a','b','c','d'])
sr

a    6
b    7
c    8
d    9
dtype: int32

In [50]:
sr[-1]

9

In [51]:
df

      uzbekistan  qozogiston  tojigiston
2015        30.4        18.8         9.6
2016        30.1        19.1         9.7
2017        32.0        13.1         9.8
2018        33.1        10.1         9.9
2019        33.4        13.4        10.4
2020        35.2        15.2        11.2

In [58]:
df.loc[[2015],['uzbekistan']]

      uzbekistan
2015        30.4

In [60]:
df.iloc[[0,3],[1,2]]

      qozogiston  tojigiston
2015        18.8         9.6
2018        10.1         9.9

In [66]:
df.at[2016,'uzbekistan']

30.1

In [67]:
sr

a    6
b    7
c    8
d    9
dtype: int32

In [72]:
sr.loc['a']

6

In [1]:
import pandas as pd
import numpy as np
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [2]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [3]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [4]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [10]:
s1.add(s2,fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

In [6]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'), index=['Olma','Anor','Uzum'])
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), columns=list('abc'), index=['Olma','Anor','Qovun','Anjir'])

In [7]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [8]:
df2

         a     b     c
Olma   0.0   1.0   2.0
Anor   3.0   4.0   5.0
Qovun  6.0   7.0   8.0
Anjir  9.0  10.0  11.0

In [11]:
df1 + df2

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  7.0  9.0 NaN
Olma  NaN  1.0  3.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

In [13]:
df1.add(df2,fill_value=0)

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   7.0   9.0  5.0
Olma   0.0   1.0   3.0  2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN   6.0   7.0  8.0

In [14]:
df2

         a     b     c
Olma   0.0   1.0   2.0
Anor   3.0   4.0   5.0
Qovun  6.0   7.0   8.0
Anjir  9.0  10.0  11.0

In [15]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [18]:
df1.rsub(df2,fill_value=0)

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   1.0   1.0 -5.0
Olma   0.0   1.0   1.0 -2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN  -6.0  -7.0 -8.0

In [19]:
df = pd.DataFrame(np.arange(1,13.).reshape(3,4), index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])
df

   Olma  Anor  Qovun  Anjir
a   1.0   2.0    3.0    4.0
b   5.0   6.0    7.0    8.0
c   9.0  10.0   11.0   12.0

In [22]:
obj = pd.Series([1,1,2,2],index=df.columns)
obj

Olma     1
Anor     1
Qovun    2
Anjir    2
dtype: int64

In [25]:
df - obj

   Olma  Anor  Qovun  Anjir
a   0.0   1.0    1.0    2.0
b   4.0   5.0    5.0    6.0
c   8.0   9.0    9.0   10.0

In [26]:
obj = pd.Series([2,3,1],index=['Olma','Uzum','Qovun'])
obj

Olma     2
Uzum     3
Qovun    1
dtype: int64

In [28]:
df

   Olma  Anor  Qovun  Anjir
a   1.0   2.0    3.0    4.0
b   5.0   6.0    7.0    8.0
c   9.0  10.0   11.0   12.0

In [29]:
df+obj

   Anjir  Anor  Olma  Qovun  Uzum
a    NaN   NaN   3.0    4.0   NaN
b    NaN   NaN   7.0    8.0   NaN
c    NaN   NaN  11.0   12.0   NaN

In [30]:
df - obj["Olma"]

   Olma  Anor  Qovun  Anjir
a  -1.0   0.0    1.0    2.0
b   3.0   4.0    5.0    6.0
c   7.0   8.0    9.0   10.0

In [31]:
df = pd.DataFrame(np.random.randn(3,4),index=list('abc'),columns=['Olma','Anor','Qovun','Anjir'])
df

       Olma      Anor     Qovun     Anjir
a -0.468207 -0.292706 -0.403902 -0.969918
b -1.092948  1.917913  0.457150  0.038170
c  0.632705 -0.042288  1.480081 -0.606999

In [32]:
np.abs(df)

       Olma      Anor     Qovun     Anjir
a  0.468207  0.292706  0.403902  0.969918
b  1.092948  1.917913  0.457150  0.038170
c  0.632705  0.042288  1.480081  0.606999

In [33]:
np.round(df)

   Olma  Anor  Qovun  Anjir
a  -0.0  -0.0   -0.0   -1.0
b  -1.0   2.0    0.0    0.0
c   1.0  -0.0    1.0   -1.0

In [34]:
df.mean()

Olma    -0.309483
Anor     0.527640
Qovun    0.511110
Anjir   -0.512916
dtype: float64

In [35]:
df

       Olma      Anor     Qovun     Anjir
a -0.468207 -0.292706 -0.403902 -0.969918
b -1.092948  1.917913  0.457150  0.038170
c  0.632705 -0.042288  1.480081 -0.606999

In [40]:
df.apply(np.mean)

Olma    -0.309483
Anor     0.527640
Qovun    0.511110
Anjir   -0.512916
dtype: float64

In [38]:
df

       Olma      Anor     Qovun     Anjir
a -0.468207 -0.292706 -0.403902 -0.969918
b -1.092948  1.917913  0.457150  0.038170
c  0.632705 -0.042288  1.480081 -0.606999

In [44]:
df.apply(np.sum,axis=0)

Olma    -0.928450
Anor     1.582920
Qovun    1.533329
Anjir   -1.538747
dtype: float64

In [45]:
df.apply(lambda x: x.max() + x.min())

Olma    -0.460243
Anor     1.625207
Qovun    1.076179
Anjir   -0.931748
dtype: float64

In [46]:
def foo(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
df.apply(foo)

         Olma      Anor     Qovun     Anjir
min -1.092948 -0.292706 -0.403902 -0.969918
max  0.632705  1.917913  1.480081  0.038170

In [47]:
df

       Olma      Anor     Qovun     Anjir
a -0.468207 -0.292706 -0.403902 -0.969918
b -1.092948  1.917913  0.457150  0.038170
c  0.632705 -0.042288  1.480081 -0.606999

In [48]:
df = pd.read_csv('https://raw.githubusercontent.com/anvarnarz/praktikum_datasets/main/usa_cars.csv', index_col=0)
df.head()

,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,6300,toyota,cruiser,2008,clean vehicle,274117,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,2899,ford,se,2011,clean vehicle,190552,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,5350,dodge,mpv,2018,clean vehicle,39590,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,25000,ford,door,2014,clean vehicle,64146,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,27700,chevrolet,1500,2018,clean vehicle,6654,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left

In [49]:
df

,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
0,6300,toyota,cruiser,2008,clean vehicle,274117,black,jtezu11f88k007763,159348797,new jersey,usa,10 days left
1,2899,ford,se,2011,clean vehicle,190552,silver,2fmdk3gc4bbb02217,166951262,tennessee,usa,6 days left
2,5350,dodge,mpv,2018,clean vehicle,39590,silver,3c4pdcgg5jt346413,167655728,georgia,usa,2 days left
3,25000,ford,door,2014,clean vehicle,64146,blue,1ftfw1et4efc23745,167753855,virginia,usa,22 hours left
4,27700,chevrolet,1500,2018,clean vehicle,6654,red,3gcpcrec2jg473991,167763266,florida,usa,22 hours left
...,...,...,...,...,...,...,...,...,...,...,...,...
2494,7800,nissan,versa,2019,clean vehicle,23609,red,3n1cn7ap9kl880319,167722715,california,usa,1 days left
2495,9200,nissan,versa,2018,clean vehicle,34553,silver,3n1cn7ap5jl884088,167762225,florida,usa,21 hours left
2496,9200,nissan,versa,2018,clean vehicle,31594,silver,3n1cn7ap9jl884191,167762226,florida,usa,21 hours left
2497,9200,nissan,versa,2018,clean vehicle,32557,black,3n1cn7ap3jl883263,167762227,florida,usa,2 days left
2498,9200,nissan,versa,2018,clean vehicle,31371,silver,3n1cn7ap4jl884311,167762228,florida,usa,21 hours left

In [58]:
df.sort_values(by='price',ascending=False)

,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition
502,84900,mercedes-benz,sl-class,2017,clean vehicle,25302,silver,wddjk7ea3hf044968,167607883,florida,usa,2 days left
1340,74000,ford,drw,2019,clean vehicle,10536,no_color,1ft8w4dt6ked32656,167780682,illinois,usa,2 days left
1336,70000,ford,drw,2019,clean vehicle,9643,no_color,1ft8w3dt3kee48276,167780680,illinois,usa,2 days left
277,67000,dodge,challenger,2019,clean vehicle,10944,blue,2c3cdzl97kh518237,167759490,ohio,usa,21 hours left
1215,65500,ford,srw,2019,clean vehicle,6500,black,1ft7w2bt0kec44818,167718954,indiana,usa,21 hours left
...,...,...,...,...,...,...,...,...,...,...,...,...
141,0,dodge,van,2008,salvage insurance,177948,orange,2d8hn44h88r669549,167756157,utah,usa,2 days left
391,0,cadillac,coupe,2000,salvage insurance,105169,white,1g6el12y9yu148063,167651218,virginia,usa,9 days left
285,0,ford,door,2000,salvage insurance,124969,black,1fafp34p7yw270338,167251902,oklahoma,usa,17 hours left
290,0,mazda,door,2009,salvage insurance,117541,gray,jm3er293590215768,167543177,indiana,usa,16 hours left
354,0,ford,pickup,2009,salvage insurance,180364,blue,1ftyr10d19pa60391,167360535,tennessee,usa,2 days left

In [59]:
df['rating']=df['year'].rank()

In [60]:
df.sort_values('year')

,price,brand,model,year,title_status,mileage,color,vin,lot,state,country,condition,rating
32,29800,chevrolet,camaro,1973,clean vehicle,46226,red,1q87t3n166389,167763370,pennsylvania,usa,22 hours left,1.0
405,25,ford,door,1984,salvage insurance,41577,white,2ftcf15y9eca14589,167611661,arkansas,usa,17 hours left,2.0
545,0,gmc,door,1993,salvage insurance,0,light blue,1gkfk16k5pj701631,167358601,colorado,usa,18 hours left,3.0
362,25,ford,pickup,1994,salvage insurance,206162,white,1ftdf15y2rnb12612,167361489,georgia,usa,2 days left,4.5
322,0,ford,chassis,1994,salvage insurance,0,green,1fdee14n7rha47894,167359174,california,usa,19 hours left,4.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...
426,55600,lexus,gx,2020,clean vehicle,8186,silver,jtjam7bx4l5251250,167605747,florida,usa,2 days left,2475.5
806,28300,chevrolet,colorado,2020,clean vehicle,13886,silver,1gcgtcen7l1101496,167805497,indiana,usa,2 days left,2475.5
2322,15000,nissan,altima,2020,clean vehicle,14320,blue,1n4bl4cv4lc134145,167656212,ohio,usa,2 days left,2475.5
2344,20100,nissan,rogue,2020,clean vehicle,10875,blue,jn8at2mvxlw103235,167614842,minnesota,usa,14 hours left,2475.5
1388,17000,ford,fusion,2020,clean vehicle,1117,gray,3fa6p0d98lr194138,167742945,pennsylvania,usa,2 days left,2475.5